Documents/DMS_РекламнаяКампания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_РекламнаяКампания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.DMS_РекламныеКампанииПредставителей</xr:Item>
				<xr:Item>AccumulationRegister.DMS_РекламныеКампании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыОперацийРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПредложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыПредложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КооперативнаяРеклама</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедиаРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МедиаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКампании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазмещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРазмещенияМедиа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматМедиаРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ФорматыМедиаРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКампании</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимостьВзаиморасчеты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/DMS_РекламныеКампанииПредставителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_РекламныеКампанииПредставителей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/DMS_ТипыРазмещенияМедиа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ТипыРазмещенияМедиа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ATL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BTL</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DMS_ВидыОперацийРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ВидыОперацийРекламнойКампании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СозданиеШаблона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКампании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DMS_СтатусыРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_СтатусыРекламнойКампании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДействует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_ОтчетПоРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ОтчетПоРекламнойКампании</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.DMS_РекламныеКампании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КооперативнаяРеклама</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКампании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчеты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/DMS_МакетыРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_МакетыРекламнойКампании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедиаРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МедиаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/DMS_РекламнаяКампания/Forms/ФормаПомощникСоздания/Ext/Form/Module.bsl
////#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ТипРазмещения = Перечисления.DMS_ТипыРазмещенияМедиа.ATL;
	КонецЕсли; 
		
	СамостоятельнаяКампания = Не Объект.КооперативнаяРеклама;
	
	Если СамостоятельнаяКампания Тогда
		Элементы.СтраницыНаименование.ТекущаяСтраница = Элементы.СтраницаНаименование;
	Иначе 
		Элементы.СтраницыНаименование.ТекущаяСтраница = Элементы.СтраницаНаименованиеСсылка;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.РазмещениеКампании;
	КонецЕсли; 
	
	ЗаполнитьСписокВыбораКампаний();
					
	УстановитьВидимостьЗаголовкиКоманд();
	
	УстановитьЗапретРедактирования();
	
	УстановитьОформлениеПолейФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ШаблонКампании = Объект.ШаблонКампании;
	
	ДатаНачалаШаблона 	 = ШаблонКампании.ДатаНачала;
	ДатаОкончанияШаблона = ШаблонКампании.ДатаОкончания;
	
	Если ЗначениеЗаполнено(ШаблонКампании) Тогда
		УстановитьОграниченияНаОснованииШаблона();
	КонецЕсли; 
	
	ПолучитьКоличествоМакетовИОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "Запись_Макеты" Или ИмяСобытия = "Запись_Отчеты") 
		И Параметр = Объект.Ссылка Тогда
	
		ПолучитьКоличествоМакетовИОтчетов();
		УстановитьВидимостьЗаголовкиКоманд();
	
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_РекламнаяКампания");
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Макеты(Команда)
	
	Отбор = Новый Структура("РекламнаяКампания",объект.Ссылка);	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.DMS_МакетыРекламнойКампании.Форма.ФормаСпискаМакетов", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Отчеты(Команда)
	
	Отбор = Новый Структура("РекламнаяКампания",объект.Ссылка);	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.DMS_ОтчетПоРекламнойКампании.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры
 
////#КонецОбласти

////#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура СамостоятельнаяКампанияПриИзменении(Элемент)
	
	Объект.КооперативнаяРеклама = Не СамостоятельнаяКампания;
	
	Если СамостоятельнаяКампания Тогда
		Элементы.СтраницыНаименование.ТекущаяСтраница = Элементы.СтраницаНаименование;
		Объект.ШаблонКампании = Неопределено;
		ШаблонКампании = Неопределено;
	Иначе 
		Элементы.СтраницыНаименование.ТекущаяСтраница = Элементы.СтраницаНаименованиеСсылка;
	КонецЕсли; 
	
	Объект.Наименование = "";
	УстановитьОграниченияНаОснованииШаблона();
	УстановитьЗапретРедактирования();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонКампанииПриИзменении(Элемент)
	ШаблонКампанииПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) 
		И ЗначениеЗаполнено(ДатаНачалаШаблона) И Объект.ДатаНачала < ДатаНачалаШаблона Тогда
	
		Предупреждение("Дата начала кампании должно быть не раньше "+Формат(ДатаНачалаШаблона,"ДФ=dd.MM.yyyy"));
		Объект.ДатаНачала = Дата("00010101");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) 
		И ЗначениеЗаполнено(ДатаОкончанияШаблона) И Объект.ДатаОкончания > ДатаОкончанияШаблона Тогда
	
		Предупреждение("Дата начала кампании должно быть не позже "+Формат(ДатаОкончанияШаблона,"ДФ=dd.MM.yyyy"));
		Объект.ДатаОкончания = Дата("00010101");
		
	КонецЕсли; 
	
КонецПроцедуры
 
////#КонецОбласти

////#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ШаблонКампанииПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ШаблонКампании) 
		И ШаблонКампании <> Объект.ШаблонКампании Тогда
	
		Объект.МедиаРесурс        = Неопределено;
		Объект.ФорматМедиаРесурса = Неопределено;
		Объект.ДатаНачала		  = Неопределено;
		Объект.ДатаОкончания	  = Неопределено;
	    Объект.ТипКампании 		  = Неопределено;
		
	КонецЕсли; 
	
	ШаблонКампании = Объект.ШаблонКампании;
	
	ДатаНачалаШаблона 	 = ШаблонКампании.ДатаНачала;
	ДатаОкончанияШаблона = ШаблонКампании.ДатаОкончания;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) И Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
	
		Объект.ДатаНачала    = ДатаНачалаШаблона;
		Объект.ДатаОкончания = ДатаОкончанияШаблона;
	
	КонецЕсли; 
	
	Объект.Наименование = ШаблонКампании.Наименование;
	
	УстановитьОграниченияНаОснованииШаблона();
	
	УстановитьЗапретРедактирования();
	
КонецПроцедуры // ШаблонКампанииПриИзмененииНаСервере()

&НаСервере
Процедура ЗаполнитьСписокВыбораКампаний()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",      Объект.Дата);
	Запрос.УстановитьПараметр("Представитель", Объект.Представитель);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РекламныеКампании.РекламнаяКампания,
		|	РекламныеКампании.РекламнаяКампания.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.DMS_РекламныеКампанииПредставителей.СрезПоследних(&Период, Представитель = &Представитель) КАК РекламныеКампании
		|ГДЕ
		|	РекламныеКампании.Статус = ЗНАЧЕНИЕ(Перечисление.DMS_СтатусыРекламнойКампании.Действует)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элементы.ШаблонКампании.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.РекламнаяКампания,СокрЛП(ВыборкаДетальныеЗаписи.Наименование));
	КонецЦикла;
	
	Если Элементы.ШаблонКампании.СписокВыбора.НайтиПоЗначению(Объект.ШаблонКампании) = Неопределено Тогда
		Элементы.ШаблонКампании.СписокВыбора.Добавить(Объект.ШаблонКампании,СокрЛП(Объект.ШаблонКампании.Наименование));
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьСписокВыбораКампаний()

&НаСервере
Процедура УстановитьМаксимальныйКодСтроки()

	Для каждого ТекущаяСтрока Из Объект.Модели Цикл
		МаксимальныйКодСтроки = Макс(МаксимальныйКодСтроки,ТекущаяСтрока.КодСтроки);	
	КонецЦикла; 	

КонецПроцедуры // УстановитьМаксимальныйКодСтроки()

&НаСервере
Процедура УстановитьОграниченияНаОснованииШаблона()
	
	Если ЗначениеЗаполнено(ШаблонКампании.МедиаРесурс) Тогда
		
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", ШаблонКампании.МедиаРесурс);
		МассивВыбора = Новый Массив();
		МассивВыбора.Добавить(ПараметрВыбора);
		ПараметрВыбора = Новый ФиксированныйМассив(МассивВыбора);
		Элементы.МедиаРесурс.ПараметрыВыбора = ПараметрВыбора;
	Иначе 
		Элементы.МедиаРесурс.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ШаблонКампании.ФорматМедиаРесурса) Тогда
		
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", ШаблонКампании.ФорматМедиаРесурса);
		МассивВыбора = Новый Массив();
		МассивВыбора.Добавить(ПараметрВыбора);
		ПараметрВыбора = Новый ФиксированныйМассив(МассивВыбора);
		Элементы.ФорматМедиаРесурса.ПараметрыВыбора = ПараметрВыбора;
	Иначе 
		Элементы.ФорматМедиаРесурса.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ШаблонКампании.ТипКампании) Тогда
		Объект.ТипКампании = ШаблонКампании.ТипКампании;
	Иначе 
		Объект.ТипКампании = Неопределено;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ШаблонКампании.ТипРазмещения) Тогда
		
		Элементы.ТипРазмещения.СписокВыбора.Очистить();
		Элементы.ТипРазмещения.СписокВыбора.Добавить(ШаблонКампании.ТипРазмещения);
		
		Объект.ТипРазмещения = ШаблонКампании.ТипРазмещения;
		
	Иначе
		
		Элементы.ТипРазмещения.СписокВыбора.Очистить();
		Элементы.ТипРазмещения.СписокВыбора.Добавить(Перечисления.DMS_ТипыРазмещенияМедиа.ATL);
		Элементы.ТипРазмещения.СписокВыбора.Добавить(Перечисления.DMS_ТипыРазмещенияМедиа.BTL);
		
	КонецЕсли; 
		
КонецПроцедуры // УстановитьОграниченияНаОснованииШаблона()

&НаСервере
Процедура УстановитьЗапретРедактирования()
	
	Запрет = (Не СамостоятельнаяКампания И Не ЗначениеЗаполнено(Объект.ШаблонКампании));
	
	Элементы.ТипРазмещения.ТолькоПросмотр 		= Запрет;
	Элементы.СтраницаМодели.ТолькоПросмотр = Запрет;
	Элементы.МедиаРесурс.ТолькоПросмотр 		= Запрет;
	Элементы.ФорматМедиаРесурса.ТолькоПросмотр 	= Запрет;
	Элементы.ДатаНачала.ТолькоПросмотр 			= Запрет;
	Элементы.ДатаОкончания.ТолькоПросмотр 	    = Запрет;
	//Элементы.ВыборПериода.Доступность		    = Не Запрет;
	Элементы.ТипКампании.ТолькоПросмотр		    = Запрет;

КонецПроцедуры // УстановитьЗапретРедактирования()

&НаСервере
Процедура УстановитьВидимостьЗаголовкиКоманд()
	
	Элементы.ФормаМакеты.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ФормаОтчеты.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
	Элементы.ФормаМакеты.Заголовок = "Макеты("+Формат(КоличествоМакетов,"ЧЦ=10; ЧН=0; ЧГ=")+")";	
	Элементы.ФормаОтчеты.Заголовок = "Отчеты("+Формат(КоличествоОтчетов,"ЧЦ=10; ЧН=0; ЧГ=")+")";	

КонецПроцедуры // УстановитьВидимостьЗаголовкиКоманд()

&НаСервере
Процедура ПолучитьКоличествоМакетовИОтчетов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РекламнаяКампания",Объект.Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МакетыРекламнойКампании.Ссылка) КАК КоличествоМакетов,
		|	МАКСИМУМ(0) КАК КоличествоОтчетов,
		|	МАКСИМУМ(МакетыРекламнойКампании.Согласован) КАК МакетСогласован,
		|	МАКСИМУМ(ЛОЖЬ) КАК ОтчетСогласован
		|ПОМЕСТИТЬ МакетыОтчеты
		|ИЗ
		|	Справочник.DMS_МакетыРекламнойКампании КАК МакетыРекламнойКампании
		|ГДЕ
		|	МакетыРекламнойКампании.РекламнаяКампания = &РекламнаяКампания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(0),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОтчетПоРекламнойКампании.Ссылка),
		|	МАКСИМУМ(ЛОЖЬ),
		|	МАКСИМУМ(ОтчетПоРекламнойКампании.Согласован)
		|ИЗ
		|	Документ.DMS_ОтчетПоРекламнойКампании КАК ОтчетПоРекламнойКампании
		|ГДЕ
		|	ОтчетПоРекламнойКампании.РекламнаяКампания = &РекламнаяКампания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(МакетыОтчеты.КоличествоМакетов, 0)) КАК КоличествоМакетов,
		|	СУММА(ЕСТЬNULL(МакетыОтчеты.КоличествоОтчетов, 0)) КАК КоличествоОтчетов,
		|	МАКСИМУМ(ЕСТЬNULL(МакетыОтчеты.МакетСогласован, ЛОЖЬ)) КАК МакетСогласован,
		|	МАКСИМУМ(ЕСТЬNULL(МакетыОтчеты.ОтчетСогласован, ЛОЖЬ)) КАК ОтчетСогласован
		|ИЗ
		|	МакетыОтчеты КАК МакетыОтчеты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.МакетСогласован Или ВыборкаДетальныеЗаписи.ОтчетСогласован Тогда
			ТолькоПросмотр = Истина;
			Элементы.СамостоятельнаяКампания.Доступность = Ложь;
		КонецЕсли; 
		
		КоличествоОтчетов = ВыборкаДетальныеЗаписи.КоличествоОтчетов;
		КоличествоМакетов = ВыборкаДетальныеЗаписи.КоличествоМакетов;
	
	КонецЕсли; 

КонецПроцедуры // ПолучитьКоличествоМакетовИОтчетов()

&НаСервере
Процедура УстановитьОформлениеПолейФормы()

	Если Объект.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона Тогда
	
		Элемент = Элементы.ДилерскийЦентр;
		
		Элемент.ТолькоПросмотр 			  = Истина;
		Элемент.ПодсказкаВвода		 	  = "<Для всех>";
		Элемент.ЦветТекста 			      = ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет;
		Элемент.АвтоОтметкаНезаполненного = Ложь;

	ИначеЕсли Объект.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.РазмещениеКампании Тогда
	
		Элемент = Элементы.ДилерскийЦентр;
		
		Элемент.ТолькоПросмотр 			  = Ложь;
		Элемент.ПодсказкаВвода		 	  = "Выберите дилера";
		Элемент.ЦветТекста 				  = ЦветаСтиля.ЦветТекстаПоля;
		Элемент.АвтоОтметкаНезаполненного = Истина;
	
	КонецЕсли; 

КонецПроцедуры // УстановитьОформлениеПолейФормы()

////#КонецОбласти
